Revit 2026 API

# InstanceNode Properties

---

The InstanceNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode) |
|  | NodeName | A readable name of the output node. (Inherited from RenderNode) |

#### Reference

InstanceNode Class

Autodesk.Revit.DB Namespace